Repository: K227-arch/Rasberry-model
Catalog: runyoro_nmt/data/tm/runyoro_en.tmx
Source language: nyk
Languages: en

source: jaagya
en: To strut about conceitedly, spread, do to excess

source: jaakaara
en: To spread (e.g. Epidemic, rumour)

source: kujaakaara kw 'endwara y 'omunywereerro kurogiirra ha bantu kwanga kuhuurra ebirukwegesibwa hali yo; emibu ejaakaaza omuswija; omunywereerro gujaalcaazibwa okuteesigangana kw'abarukugonzangana
en: The spread of HIV/AIDS is as a result of people's disobedience in observing what is being taught about it; Mosquitoes spread malaria; The spread HlV/AIDS is due to unfaithfulness among sexual partners. Oku-

source: jaamaara
en: To be dull, stupid, clumsy. Jaara,

source: jaara
en: To make a jarring noise, gambling game

source: ekijeerre kijaarra hamunwa gw 'ekiina kyakyo
en: A cricket will make a jarring noise at the mouth of its hole

source: jaata
en: To be sodden (millet flour), be clumsy, be worthless

source: jabagira
en: To bubble, seethe. Jabajabuka

source: jabajabura
en: To pull to pieces, to pull out threads

source: jabanganiza
en: To talk rapidly or indistinctly, mispronounce

source: jabiza
en: , to be excited

source: jabuka
en: To be chipped, broken.

source: haroho abasaija abagira engeso y 'okubajabuurra ebyokulya enjara obu eba ebali kubi; amujabwize ebyokulya bitakahiire
en: Ear, etc.), crop (ear), break a piece off; Some men are in the habit of asking their wives to give them food while it is being cooked when they feel hungry; He has made her to give him half cooked food

source: jagaata
en: To be hairy, be shaggy

source: jagajaga
en: To walk stiffly, awkwardly

source: naaganya kujagajagira omubantu
en: He/ she is troubled when he/she thinks of walking awkwardly among the people

source: jagaraza
en: To excite, spread out fingers

source: jagiriza
en: To flatter

source: jaguza
en: To rejoice, celebrate.

source: jaika
en: To gad about, roam about

source: jajura
en: To burn slightly causing to wither, superficialJy burnt, cook too fast, burn up

source: jakura
en: To snatch from

source: jaliga
en: To squelch (swamp)

source: jamajama
en: To jabber, babble

source: janguurra
en: To explain fully, put right what bad gone wrong

source: janjaara
en: To behave like a madman, roam about, spread

source: omuguwiraro ajanjaarra omubantu abamumanyire; omuntu aina obmwaire obukutuurra ayerinda kubujanjaaza omu bagenzi be
en: A mad person roams among people who know him/her; A person suffering from a contagious disease is always careful not to spread it to his/her neighbours

source: janjaba
en: To care for, nurse, treat, attend to

source: bakamusiima habw 'okujanjaba Isebo akamujanjabira ameezi mukaaga; tiinyina muntu w'okunjanjabisa omurwaire onu; akajanjabwa mukazi we
en: They thanked her for attending to their father, She cared for him for six months; I do not have anyone to help me with the care for this patient; He/she was cared for by his wife

source: janjagaarra
en: To be untidy, loose (esp. Bundle)

source: enkoko empangi ejanjagaraza amapapa gaayo eboine enkazi
en: A cock will spread its wings before a hen. To fasten or cover Loosely

source: jarabanga
en: To spoil, treat carelessly

source: jaragana
en: To be spread about (many things)

source: jaragatana
en: To be spread about

source: jaruka
en: To be lively (when intoxicated)

source: jeba
en: To be moist, sodden

source: jebeera
en: To wander about (hom eless person)

source: abazaire obu baafiire boona yateekereza h 'okujeebeerra haamubura
en: When all bis/her parents died he/she thought of places where to wander about without success

source: janjagurwa
en: Talk irrelevantly

source: janjalika
en: To fasten or cover loosely

source: Jeera
en: To roam, ramble

source: jega
en: To be loosely tied:

source: jegeja
en: To rain persistently

source: -enjura ekajegajera esaaha isatu zoona,
en: -it drizzled persistently for three full hours

source: jegejege
en: Loosely

source: jegema
en: To grow old and wrinkled, have swollen chicks

source: oburwaire yarwaire nubwo bwamujegemeze
en: It was illness that made him grow old and wrinkled

source: jegemera
en: To totter

source: jejegurwa
en: To be talkative, gossip

source: akabatanga kujejegulirwa omuka ye
en: He prohibited them from gossiping in his home

source: jegya
en: To loosen.

source: jeijcza
en: To attend, accompany.

source: jenga
en: To sing, dance (hill tribes)

source: jenja
en: To spread rumours

source: jenjeera
en: To wander about (insects)

source: jenjeka
en: To tie loosely.

source: jogeza
en: C

source: jogolekwa
en: To be talkative, be a chatterbox

source: jogolikana
en: =jol ekana

source: jogoma
en: To rumble (flatulence), also dogoma, duguma

source: jogomba
en: To walk like an old person

source: jogomora
en: To take out many or much (esp. From a, bundle), j. Ebikali (of child who wets the bed), urinate in or on

source: jogorwa
en: To be talkative

source: joimoka
en: To go out in the rain needlessly.

source: jonjogorwa
en: To tell what ''has happened, reveal secrets, gossip

source: jonjoma
en: To talk in a husky voice, mutter

source: jonjoora
en: To behave as a bull y.

source: jonjooza
en: To abuse, treat with contempt, harass;

source: jookooza
en: To spend one's time unprofitably, go out in the rain or at night

source: jooliima
en: To speak lazily

source: juba
en: Adv., lately. J uba, ku-, oku-, v.i.•

source: enjura em11tiire yamujubya
en: It has rained on him/her · ' made him/her wet

source: omuntu obu alWara omukanwa bamuha omubazi gw'okujubata
en: When a person complains of mouth sores they give him/her medicine to keep in the mouth for a while

source: jubuka
en: To be free of soap and dirt after being rinsed inclean water (cloth). J

source: jubura
en: To pass through or rinse in clean water, and then take it out in order to dry.

source: juga
en: To low, bellow, bleat

source: ente ejugira omwana gwayo;
en: A cow lows for its young;

source: juguma
en: To tremble, shiver

source: ajugumiire kwikara omumbeho atajwaire kooti; embeho emujugumize
en: He/ sheshivered because he/shestayed in the cold without a coat; Cold has made him/her shiver

source: jugumbya
en: To mobiUze, shake

source: jugunya
en: To throw away,

source: juma
en: To scold. Revile, abuse, blaspheme

source: akam11jumira obugara
en: He/she scolded him/her for laziness

source: jumagira
en: To walk with head bent

source: jumba
en: To grow fresh leaves, flourish

source: jumbika
en: Pass forrn, j umbikwa, ku-, oku-, 1{pf. -jumbikirwe)

source: jumbira
en: To finish paying dowry, be engaged to (a man), court

source: jumbinva
en: To be engaged to (a woman).

source: jumbukira
en: To fly out at, scold.

source: jumbutura
en: To raise one unexpectedly

source: jumbuurra
en: To give a child medicine (from mouth to mouth)

source: niinyija kukujumbuurra etaaba esaarra;
en: J am going to treat you with bitter tobacco as medicine; L

source: jumbuutukira
en: Pr

source: jumbuza
en: To make an early start, visit a neighbour very early in the morning

source: abaana baahanwaga okutajumbulizaaga omumaka g 'abandi
en: Children were advised not to make very early visits to other peoples homes

source: jumira
en: To low (cows calling calves)

source: ente ejumiirra omwana gwayo; ekijumiza ente nukwo okutarora omwana gwayo omumaiso
en: A cow lows for its young; What makes a cow low is failure to see its young in sight

source: jumuurra
en: Pr

source: juna
en: To rescue, save, help, succour

source: ataina w 'okumujunira tarwanira mu baingi; akamujunisa amaani ge; omuntu ajunwa obu atwara Yesu kuba Mukama we kandi mujuni we
en: He who has no one to rescue him/her in case he/she gets overpowered will not fight in public; Be/she rescued him/her by using his/her strength; A person is saved when be/she takes Jesus to be his/her Lord and persona] saviour

source: junaana
en: To claim, hold responsible blame

source: noojunaanwa omusango gw 'okwemereza motoka omukiikaro ekitaikiriziibwe
en: You are charged with parking a vehicle in a no parking area

source: junaaniza
en: To call to account for, concerning

source: ). amagoba
en: Practise usury

source: junaaoizibwa
en: To be responsible

source: junda
en: To rot, go bad, spoil, decay

source: ebijuma ebijunzire tibiriibwa; ebyenju bikajundira omuly ahuurro; obugoigo; ebihimba bye bijunziibwe kuteerwa enjura
en: Rotten fruits are not eaten; Ripe plantains got rotten in the store; Obumu babanza k:ubujunza nukwo babuhooga, some sisal must be made to rot before people get fibre from it; Her beans are rotten for having been rain soaked

source: jundeera
en: To smouJder, glow

source: junga junjuruma ekikoomi baataireho ebinyansi bibisi kikajundeerra ebiro bibiri byona; bakata ebiti bibisi omumuurro ogurukubuguma byagujundeeza
en: A burning heap of grass to which wet grass was added smouldered for two days; They put fresh wood in the glowing fire and made it smoulder

source: juoga
en: To squeeze ju ice out of (plantains, etc.)

source: jungm1rra omwana obuheke bw'oburo a/ye
en: Rub in the bands husked millet grains so that a child may eat some. Jungi sa, ku-, oku-, v.c

source: jungutuka
en: To be moist and soft (soil)

source: ekijungutukya itaka nukwo kuba n 'orwezoorurungi
en: It is the manure in tbe soil that makes it moist and soft

source: junguurra
en: To discard, allow to fall into disuse. '

source: junira
en: To rescue

source: junjubara
en: To spread, grow big (trees), look very big and fearsome, (tuuma)

source: ebijwaroebimu bijunjubaza omuntu
en: Some clothing make someone look very big and fearsome

source: junjubura
en: To gnaw at voraciously

source: omuntu ataina maino Jasobora kujunjuburo enyama; tinkabonaga ekijunjumiirra nikijunjumiirra omunju
en: A toothless person will not gnaw at a piece of meat voraciously; I have never seen a carpenter bee buzzing from a house

source: junjumuka
en: To be hairy

source: abantu baingi nibeekaguza kiki ekimujujumukize bwangu kili
en: Many people are asking themselves what has made him/her grow so fast

source: junjuruma
en: To roar, hum

source: junjuura
en: To buzz

source: abaira baikirizaaga ngu enjunJuuzi tejunjuurra busa
en: People of the past believed that a buzzing bee would never buzz in vain

source: jura
en: To decline (sun)

source: Jura
en: To regret, yearn for, be home-sick

source: - ekyamujulize nukwo kuburwa amata aga yanywaga buli kiro
en: - what made him/her yearn is the lack of milk he/she used to drink daily.

source: jurru
en: Adv., intensive with lazy, very lazy person

source: jurubana
en: To be smeared all over, dirten yourself with soft mud from cattle dung when clearing it

source: juruguuta
en: To thrust, prod repeatedly (as when killing an animal).

source: juta
en: Ll' ' ' plump, chubby (little child)

source: juubya
en: To cook and then roast (unripe millet), j. Amatama, pout, look cross. Ju ujura, ku-, oku-, v.tr

source: juuka
en: To run away from the herd or other cattle

source: ente eny akuteegere ejuukira nambere enimi eri
en: A cow on heat will run away from its herd to where the bull is

source: juumara
en: To lie prone

source: juumib
en: To tum upside down

source: kulinda obwana bw'enkoko ebihungu abantu ba ira baabujuumikiraga ekigega
en: In order to prevent chicks from being preyed on by eagles. People of long ago would cover them with a basket. Juumildra, ka-, oku-, v.tr

source: juamilcinna
en: To invert on the top of, cover with inverted vessel. Juumu kura, ku-, oku-, v.rr

source: akamusaba amuj11umuku 11rre ekigega arole ekiri lransi yakyo
en: He/she requested him/her to tum the basket right way up so that he/she might see what was under it

source: juumura
en: To tum right way up; come to the help of;

source: juura
en: To take off clothes, undress, wear indecent clothing that shows private parts

source: jwara ekiteteei ekirailr ire otaija kufuurra abantu; omuzaire we akamu j uuzaamu on1goye orutasemeriire k11jwarwa
en: Dress descently lest you show your private parts to people; Her parent made her take off a dress which was not good for her to put on

source: juurra
en: To appeal. Refer to, cite, quote, give evidence.

source: juuruuka
en: To be undressed, fall off (cloth)

source: orugoye akaba aibire bakarumujuulizaamu omumaduuka
en: They forcibly made him/her take off the cloth he/she had stolen at the shops

source: juza
en: To politely, gently persuade father-in-law to lower the price (e.g. Bride price, dowry, fine), bargain for deduction

source: jwa
en: To flow, bleed, menstruate

source: izooba litujweriire; Ruhanga af wisa omusana
en: The sun has shone upon us; Omuf ungi ajwisa ensande, God causes the sun to shine, a plantain treader causes juice to flow from plantains

source: jwabiirra
en: To be untidy esp. Around the mouth after a meal or drink

source: jwabira
en: To be smeared all over

source: e zijwabiriire ebisajwa; nfwahire kubahaga ebiragiro bya11ge nimubicwa; abagenzi bajwal11ra muno hakutemba ensozi; abaana bato bajwahibwa kumara obusumi bwingi baikaliire
en: His/her fingers are smeared with fat all over. Jwa ha, ku-, oku -, v.i; I am tired of giving you my rules of which you always break; Travellers get more tired on climbing hills; Young children get tired when they sit for a long time

source: jwabisa
en: To make one tired, weary

source: jwahuka
en: To hurry, hasten, be eager, willing, hospitable

source: jwahukilrra
en: To do quickly or willingly, welcome gladly, be receptive.

source: jwaburuka
en: To be refreshed, take a rest

source: jwamba
en: To be dirty

source: jwambura
en: To do quickly

source: jwangana
en: -to mix together

source: tegwire
en: I t bas not fallen {cl.4), tefiire, it has not died (cl.9). Ta- Negative prefix after a personal prefix or a pronomina l concord: ntamubone, Idid not see him

source: ta
en: Negative prefix, before U1esingularsubject second and third person prefixes,o- and a-,respectively and subject pronominal concord for classes 4 and 9

source: ekitabu nkitaire hameeza; nteera ekitabu kyange kinu hameeza; omukono gukateebwaho omuhilcirwa. the Prime minister signed. -ta
en: I have put the book on the table; Put this book of mine on the table; \ Modal particle, that requires a subj. Personal prefix or pronom. Concord to express an intorogative adv., meaning, how? Abakazi balima bata? How do women dig? Ente zijuga zita? Bow do cattle mow? Oroho ota? How are you? Taaba, e-, n.cl.9

source: taabaana
en: To be over burdened with work, wander, scatter, grope, look or cry for help in vain

source: isebo obu yafiire bakataabaanira omubiikaro ebitali bimu; okufa kwa isebo kuka bataabaniza
en: When their father died, they scattered in different places; The death of their father made them scatter

source: taabataabaana
en: To work all alone, to be tossed about, to search for help in vain

source: nitutaabataabanira omunsi omw 'iguru tuliiteekaana
en: We are searching for help here and there without success on earth, but we shall search no more in heaven

source: taaga
en: To be in great distress and need, cry out for help

source: omusaiJa amutaagisize; akakira kutaagisibwa kumuteeza eldJumbura
en: The man has made him/ her cry out for mercy; What caused him/her to cry out for help most was being struck with stinging leaves

source: taagataagura
en: To tear in pieces, devour

source: ekisoro embwa zikakitaagatagurazaakirya kyona
en: The dogs devoured the animal and ateitall

source: taagira
en: To beg for mercy

source: akataagira owanyina kwija kumuJunira, baitu yasangwa ataroho
en: He/she appealed to his/her brother to come to his/her rescue, but she/she was not around

source: taaguka
en: To be torn, laugh loudly

source: -aminah ataaguka muno
en: -aminah laughs loudly.

source: taagura
en: To tear in pieces, mangle, rend

source: akamunyegeerra habw 'okumutaaguurra orugoyerwe; ekiniga kikamutaaguza ebbaruha ezi akaba amuhandiikiire
en: He/she accusedhim/her for tearing his/her cloth; Indignation caused her to tear the letters he had written to her

source: taaha
en: To arrive, enter, go home

source: obugenyi; banywani be baizire kumutaahira obugenyi; obugenyi bw'omutabani bukataalrwa abantu baingi
en: Attend party; His friends have come to attend bis wedding; His son's wedding was attended by many people

source: taahtirra
en: P1:2

source: Bahemuka araire ataahiriirwe abasuma
en: Last rught burglars broke into Bahemuka 'spouse

source: taahira
en: To take poseession of site that bas been left by someone else

source: taahirirwa
en: Be sulky, sullen

source: -ogu ataahiririrwe omwegenderezeege obu araabaga noobaza nawe
en: -that man is sullen, you should be careful when talking to him

source: taahirwa
en: Pass

source: ira omun111 obu yataahinvaga abagenyi yayetaga abantu ab 'okwija kubaza nabo
en: In the past when a person got visi tors, be/she would invite some people to come and keep tbem company

source: to make enter; Barwenda akataahisa empisi obugenyi. Barwenda invited a hyena to a wedding
en: Attend wedding; (he that wants trouble)

source: taahisa
en: To generate income to the owner of an activity

source: omunyoro akataahya omufuruki 0mu kibanja ekikaba kiri kya Bisereko
en: The chief gave the emigrant the site that was deserted by Bisereko

source: taahya
en: To receive present from a superior

source: obu akaba naamara obuheereza bwe mb '0mukama akataahya enyana; t. omukazi
en: When he ended his service at the palace he received a heifer from the King; To marry

source: -kinwa kya nte kitaahibwa Rubaga
en: -it is by Gods Grace that the mouth of a cow comes back home safely

source: taakura
en: To scratch (as hen or dog) in ground

source: enkoko kutaakuurra obwana bwayo obuhuka etaakuza enono zaayo
en: A hen uses its claws in order to scratch for insects from the ground for its chicks

source: taama
en: To be clumsy, careless, stupid

source: taamataamura
en: To tear in pieces, raven,

source: ekiniga kikamutaamataamuza ekisisani bakaba batiirwe bombi
en: Fury made her tear into pieces the photo they had taken together

source: taamuka
en: To be torn

source: orugoye rwe rukataamukira omukizaaniro nibazaana
en: Her/his cloth was tom while they were playing inthe play ground

source: taamura
en: To tear

source: akamulehesa habw 'okumutaamtwrra orugoye rwe
en: He/she fined him/her for tearing his cloth

source: taana
en: To be next to (separated by a boundary), border on, be adjacent, separate, take different roads

source: ebibanja byabo nibitaanira hakasozi eruguru
en: Their plots border each other right on top of the bill

source: taaruuka
en: To walk aimlessly (as one in despair), wonder about

source: rwebagyo mmuboinege naataaruuka; Baitu tiimmanyirege mbere abaire naataaruukira enaku nizimutaaruukya
en: Yesterday evening walking aimlessly and Icould not tell where he was walking to; Necessitfos are making him/her walk aimlessly

source: taata
en: . My father, reply to a call, term of respect

source: -Oraire Ota Taata?
en: -Good morning Sir/ Father

source: taatlirra
en: To worry about oneself

source: Mukama akagamba ali Weena anya kutaatii"a obw 'omeezi bwe alibufeerwa
en: , the Lord said that whoever worries about his/her life, will lose it

source: taba
en: To be many coloured

source: erangi z'omukeeka gunu itabire
en: The colours of this mat are mixed up

source: ekinyege kyange nyamutaba kyantaba n'abataahi; enkinzo batabisa omukeeka bagyeta orukato
en: My rattle the gatherer has caused misunderstandings between me and the neighbours; The needle they use to weave the mat is called orukato, pass. Form, tabwa, ku-, oku-

source: tabaara
en: To go to war, go up to the capital or to the King's palace to meet the King. Tabaaro,

source: akamutuma kumutabaliirra egaali ye; akamusaba kumutabaaliza ebintu bye
en: He/she sent him to pick bis bicycle; He requested him/her to join him/her fetch his/her things

source: Tabaarukya Tabaaza
en: To welcome home a person from battle or from a long distance To make to go far

source: obutamanya butabaaza araafa; omukama atabaazibwa abantu baingi muno
en: Ignorance makes one go for a war; A King is buried by very many people

source: tabaijuka
en: To stumble, trip up, save oneself by running a few paces.

source: - akateerwa enkonge yatabaijuka yagwa,
en: - he/she stumbled upon a stone and then fell down

source: tabaijura
en: To make to stumble

source: tabanganiza
en: To mix together

source: tabanguka
en: To be stirred up, become muddy. To stir up, upset

source: tabatabuka
en: To get worse, spread (sores)

source: tabika
en: To mix, join together

source: tabira
en: To cover with soil, to cover beer in a hole for fermentation

source: tabirana
en: To weave in coloured threads, mix colours together

source: tabiza
en: To bring trouble on, get (another) into trouble

source: tabuka
en: To be boiling hot, escape, survive

source: akatabukira hake kufa
en: He survived death narrowly

source: tabukatabuka
en: To be stirred up, mixed, in a muddle

source: tabura
en: To stir up, mix, miss, fail to hit, save, rescue

source: -Akamutabuurra hake kumutomera
en: -he nearly knocked him/her down

source: tabya
en: To create a wrangle

source: tadooba
en: Small kerosene lamp

source: taga
en: To be happy, carefree

source: omwana obu aba ali omba nyinenkuru ataga
en: A child becomes carefree while at it 's grandmother's home

source: tagaarra
en: To take up much space, spread out, extend

source: abaikoarra omumatoko bafunzire tibatagaraza maguru gaabo
en: Those who sit in a car in excess do not spread out their legs

source: tagaija
en: To be frolicsome, gay

source: kutagaija kw 'abaana kookuroorraaho k 'eko erumu okusemererwa; babairege nibatagaizira omuzigati y'owaabu
en: The frolicsomeness of children is a sign of happiness in a home; They were playing gaily in their compound

source: tagaizira
en: To mock, speak sarcastically to

source: tagangara
en: To be puzzled, distracted, stumble

source: tagasa
en: To heat, warm up

source: amaizi bagatagasiza omusafaliya
en: Water is boiled in a sauce pan

source: tagata
en: To become warm

source: amaizi gatagatira esaaha nke baitu gatwara esaaha nyingi kufako
en: Water takes a short time to become warm but a long time to become cool

source: tagiza
en: To be joyful, be happily busy, dash about excitedly

source: taha
en: To draw (water}, bale ladle out

source: omuntu mukuru obu agenda haiziba, asemeriire kumutahira amiazi,
en: When an old person goes with a child to the well he/she must draw water for the young one

source: tahata
en: To bold or carry carefully on open palm

source: amata gatahatwa ayagatahasire
en: Atakagatahataga, tagatahata, milk in a wooden vessel is carefully carried on open palm by a person who has ever carried it so, one who has never done so is not able to do so

source: tahisa
en: To draw water with, let down (pitcher, etc.) for water

source: tahuka
en: To stagger, be weak (after purge)

source: tahura
en: To push forcibly, take along by force

source: omubazi anywire gumutahwire muno gwamumara amaani
en: The medecine he/ she bas taken has made him/her weak (as a result of being purged)

source: tahyatahya
en: To be undecided, waver, ramble

source: taiga
en: To go many times

source: taisa
en: To drop, miss, fail to hit or catch

source: taisuka
en: To slip and fall, escape

source: akaba naagya kuhandiika ekalaamu yamutaisuka yagwa; akataisukira om11muhanda yain1ka yamusig a
en: As he/she was going to write, the pencil slipped out of his hands and fell down; He/she escaped from him/her while on the way.

source: taisukaniza
en: To separate, divide into pieces

source: abateezi b'entomihobo n 'omumu w 'olmbataisukaniza omukuteerangana kwabo
en: Boxers in the game of fighting are separated by a referee

source: taisura
en: To let slip, let go, release
